app/controllers/api/v1/users_controller.rb

  def create
		@user = User.new(name: params[:name], username: params[:username], password: params[:password])
		usernames = User.all.select { |user| user.username == @user.username}
		if usernames.length < 1 && @user.save
---
SELECT "users".* FROM "users"
INSERT INTO "users" ("name", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def save_financials
    current_user.update(assets: params[:assets], average_annual_income: params[:average_annual_income], credit_score: params[:credit_score], total_debt: params[:total_debt])
---
UPDATE "users" SET "assets" = $1, "average_annual_income" = $2, "credit_score" = $3, "total_debt" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["assets", "50000"], ["average_annual_income", "500000"], ["credit_score", "620"], ["total_debt", "450"], ["updated_at", "2017-09-28 14:21:07.907721"], ["id", 1]]