app/controllers/api/v1/user_listings_controller.rb

	def create
		if current_user == "hello from current User"
			render json: {msg: 'You must be logged in to save'}
		else
			address = params["0"]["address"]["street"] + ", " + params["0"]["address"]["city"] + ", " + params["0"]["address"]["state"]
			lng = params["0"]["address"]["longitude"]
			lat = params["0"]["address"]["latitude"]
			rent = params["2"]
			taxes = JSON.parse(params["3"]["data"]["body"])["property"][0]["assessment"]["tax"]["taxamt"]
			@listing = Listing.find_or_create_by(rent: rent, address: address, taxes: taxes, latitude: lat, longitude: lng)
			user_listings = UserListing.all.select { |user_listing| user_listing.listing_id == @listing.id && user_listing.user_id == current_user.id}
---
INSERT INTO "listings" ("address", "rent", "taxes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "[\"10 Creston AveUnion\", \"NJ\"]"], ["rent", 1850], ["taxes", "6022.01"], ["created_at", "2017-09-25 23:05:19.984261"], ["updated_at", "2017-09-25 23:05:19.984261"]]
SELECT  "listings".* FROM "listings" WHERE "listings"."rent" = $1 AND "listings"."address" = $2 AND "listings"."taxes" = $3 AND "listings"."latitude" = $4 AND "listings"."longitude" = $5 LIMIT $6  [["rent", 3500], ["address", "10 Vauxhall Rd, East Brunswick, NJ"], ["taxes", 13948], ["latitude", "40.457839"], ["longitude", "-74.414389"], ["LIMIT", 1]]
SELECT  "user_listings".* FROM "user_listings" ORDER BY "user_listings"."id" ASC LIMIT $1  [["LIMIT", 1]]

	def destroy
		listing = Listing.find_by(address: params[:address])
		user_listing = UserListing.find_by(listing_id: listing.id)
		listing.destroy
---
SELECT  "listings".* FROM "listings" WHERE "listings"."address" = $1 LIMIT $2  [["address", "10 Vauxhall Rd, East Brunswick, NJ"], ["LIMIT", 1]]
SELECT  "user_listings".* FROM "user_listings" WHERE "user_listings"."listing_id" = $1 LIMIT $2  [["listing_id", 2], ["LIMIT", 1]]
DELETE FROM "user_listings" WHERE "user_listings"."id" = $1  [["id", 1]]